import examinationTools from "../assets/examination_tools.png"; 

const AboutAs = () => {
  return (
    <div className="text-black text-center" id="AboutAs">
        <p className="items-center text-4xl font-bold mt-10">نبذة عنا</p>

       {/* Desktop*/}
        <div className="hidden md:flex bg-blue-100 w-full h-full flex-row-reverse mt-10 items-center justify-center p-20">
        <img
        src={examinationTools}
        className=""
        alt="bgAsset"
      />
      <p className="text-2xl text-start leading-loose" style={{ direction: 'rtl' }}>
      اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .
      </p>
    </div> 

       {/* modile*/}
    <div className="md:hidden bg-blue-100 w-full h-full flex flex-col mt-10 items-center p-5">
        <img
        src={examinationTools}
        className=""
        alt="bgAsset"
      />
      <p className="text-sm text-start leading-loose" style={{ direction: 'rtl' }}>
      اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .اكتشف طريقة أكثر ذكاءً للتعلم والتدريس والنمو باستخدام منصتنا المتقدمة .
      </p>
    </div> 
 </div>
  )
}

export default AboutAs